{
	"name" : "Social Warfare",
	"slug" : "social-warfare",
	"download_url" : "https://downloads.wordpress.org/plugin/social-warfare.zip",
	"version" : "2.0.0",
	"last_updated" : "2016-06-13 15:10:00",
	"requires" : "3.0",
	"tested" : "4.5",
	"author" : "Warfare Plugins",
	"sections" : {
		"description" : "Your Ultimate Social Sharing Arsenal",
		"changelog" : "<p><b>2.0.0:</b>Check out the <a target='_blank' href='https://warfareplugins.com/social-warfare-2-0/'>blog post</a> for all the updates included in this version.</p><p><b>1.4.8:</b> Google Analytics Event Tracking!!!<ul><li><b>New:</b> Added support for Google Analytics Event Tracking for button clicks!</li><li><b>New:</b> Added Italian to the list of available languages.</li><li><b>Fixed:</b> Fixed the call to undefined class error.</li><li><b>Fixed:</b> Fixed a javascript validation conflict with ACF, WooCommerce and a few other meta fields.</li><li><b>Fixed:</b> Made it so the icons won't be hidden when overly generic selectors are used to hide :before pseudo elements.</li></ul></p><p>1.4.7: Emergency Bug Fix for a PHP Error. I rebuilt a big chunk of the plugin recently, and it turns out that I still had a call to one of the functions from the old version. It was a call to a PHP function that now no longer exists and has been replaced with a new function. I thought I had all of these replaced, but I had missed one. My apologies to all for the hassle of needing two updates in one day, and I thank you all for your patience and support.</p><p>1.4.6: Minor Bug Fixes<ul><li>Fixed: Fixed the 404 error that was appearing sometimes in the javascript.</li><li>Fixed: Fixed the javascript error when uploading custom social media images on the post editor screen.</li></ul></p><p><b>1.4.5: Mooaar Buttons and Bugfixes</b><ul><li>New: Added a Buffer Button.</li><li>New: Added a Pocket Button.</li><li>Update: Updated the total shares count to be more compact and beautiful than ever.</li><li>Update: The share recovery tool now works in virtually every possible changed-permalink scenario.</li><li>Update: Removed UTM and link shortening from StumbleUpon.</li><li>Update: Make the cache trigger only fire on pages that contain share buttons.</li><li>Fixed: Twitter Share Counts are Fixed!</li><li>Fixed: Prevent double @ signs on Twitter handles.</li><li>Fixed: The minimum width option now works properly for sidebar share buttons.</li></ul></p><p>1.4.4: <b>A Well Balanced Update</b><ul><li>New: Share Recovery now supports going from www to non-www</li><li>New: Added Portuguese language option</li><li>New: Added Danish language option</li><li>New: Added a Millions feature for posts with more than 1M shares</li><li>New: Transition for slide floating buttons reveal</li><li>New: Fade in effect to hide button sizing on page load</li><li>Updated: Font links now have version parameters</li><li>Updated: AJAX cache update trigger</li><li>Updated: Sizing algorithm now works better than ever</li><li>Updated: Removed Sitewide option for floating buttons</li><li>Fixed: Update checker when DEBUG is active</li><li>Fixed: Twitter connection check so it’s not running constantly</li><li>Fixed: Link shortening On/Off toggle</li><li>Fixed: Mixed content on WooCommerce HTTPS pages</li><li>Fixed: 500 internal server error that the excerpt functions periodically caused</li></ul></p><p>1.4.2: <b>Lots of little updates!</b><ul><li>Update: Added clickjack protection from Start A Fire</li><li>Update: Made it so that all frames from the same domain are immune to the frame buster.</li><li>Update: Added a mechanism to check the Twitter count connection status on the system status page.</li><li>Update: Upgraded all Bitly functions to use the fare more secure OAuth authentication protocols.</li><li>Update: Added the option to use commas as the decimal separator for certain languages.</li><li>Fixed: Fixed a conflict with LabPages plugin where they were defining a constant with the same name as one of ours.</li><li>Fixed: Changed all references to get_the_permalink() to get_permalink() so it doesn't throw any errors when user's are on a version of WordPress prior to 3.9.</li><li>Fixed: Fixed a minor margin issue on the option page.</li></ul></p><p>1.4.1: <b>Twitter Share Counts Returned to All!</b><ul><li>Update: Restored Twitter Counts!</li><li>Update: Added two new Click to Tweet styles.</li><li>Update: Updated the way the previews work for the buttons and the Click to Tweets on the options page.</li><li>Fixed: HTML encoding for titles and descriptions in the meta tags.</li><li>Fixed: Defaulted the new buttons to off.</li><li>Fixed: Squashed an 'undefined variable' bug. </li><li>Rearranged the order of the Social Warfare Options tabs to make more logical sense.</li><li>Read more here: <a href='https://warfareplugins.com/version-1-4-1/' target='_blank'>Twitter Counts are Back! And a Few Other Goodies</a></li></ul></p><p>1.4.0: Bug Fixes and <b>Brand New Buttons!!</b><ul><li>Update: Added a WhatsApp share Button!</li><li>Update: Added a Yummly Button!</li><li>Update: Added an Email Button</li><li>Update: Made WordPress posts sortable by the number of shares in the admin panel.</li><li>Update: Added a Facebook Author tag.</li><li>Update: Added an option to enable the legacy cache rebuilding method.</li><li>Fix: Remove the padding from the body when the top/bottom floating buttons are not visible.</li><li>Fix: Button alignment is wrong prior to the first cache build.</li><li>Fix: Fixed the UTM parameter question mark bug.</li><li>Fix: Fixed HTML symbols on Click-to-Tweets</li></ul></p><p>1.3.19: Another Pack of Minor Bug Fixes<ul><li>Update: Removed the 'Hide Zeroes' option. We now hide all zeroes.</li><li>Update: Added a social media identity tab to the option page with new Facebook Publisher URL and APP ID fields.</li><li>Update: Floating buttons now appear with manually placed ones.</li><li>Performance: Improved the cache rebuild trigger.</li><li>Fix: Removed short links from Reddit Shares.</li><li>Fix: Filter Open Graph tags for Quation marks.</li><li>Fix: The Twitter 'Site' tag was being output twice.</li><li>Fix: Simple Podcast Press was outputting conflicting Open Graph tags.</li><li>Fix: The floating sidebar now hides properly on mobile.</li><li>Fix: The registration 'Infinite Loop' bug should now be gone for good.</li><li>Fix: The subtitles plugin was making the share title waaaaaay too long.</li></ul></p><p>1.3.17: A Pack of Minor Bug Fixes<ul><li>Fixed: The Pinterest image doesn't display properly when it's URL contain certain special characters.</li><li>Fixed: The 'Check Registration' function throws an error sometimes.</li><li>Fixed: The cache rebuild URL parameter begins with a question mark even when the URL already contains a question marked URL paremeter in front of it.</li><li>Fixed: The Yoast Facebook Author tag is being turned off when Open Graph tags have been filled in.</li><li>Fixed: Left floating buttons do not appear on WordPress pages, only on posts and other post types.</li><li>Fixed: On some iOS browsers, the click event for the buttons was not firing correctly.</li><li>Fixed: A typo in the admin_page_class.js was creating an 'Unexpected Expression' error.</li><li>Updated: Improved the logic of the algorithm that sizes the buttons.</li></ul></p><p>1.3.16: Changed the hosting location of the icon font.</p><p>1.3.15: Added some more Bitly failsafes, and modified some of the registration functions. Working on reducing API calls, and putting things in place so that if an API call fails, it does so more gracefully.</p><p>1.3.14: Upgrading some of the functions regarding Bitly and the Vertical Floating buttons.<ul><li>The Bitly integration is now smarter than ever. It only generates shortlinks during the background cache rebuild process so that whether it fails or not, there is no reduction in load time performance.</li><li>The floating buttons can now be turned on or off independent of the horizontal buttons. They can appear alongside the horizontal buttons or all by themselves. You can control this on the 'Display Locations' tab or on any post editor itself.</li></ul></p><p>1.3.13: Fixed a hiccup in the Bitly API that was causing it to not connect leading to prolonged page load times. Also, modified the trigger for resetting the cache to improve the way it functions with updating Open Graph images and whatnot.</p><p>1.3.12: Today's update linked to the wrong javascript file. This fixes that.</p><p>1.3.11: Improved the logic behind the Open Graph meta fields and the way that our plugin coordinates efforts with Yoast SEO when it is installed alongside of Social Warfare. <a target='_blank' href='http://warfareplugins.com/support/open-graph-twitter-cards-yoast-seo/'>Read More</a></p><p>1.3.10: Fixed an error code that was displaying in the last version and adjusted the alignment of side floating buttons when very little space is available in the margin of the page.</p><p>1.3.9: This version brings some huge performance optimizations. The goal is to make this plugin have as close as possible to absolutely no impact on the load time of posts and pages.<ul><li>1. New Feature: Added a shortcode generator for quickly and easily embedding share buttons directly into posts including share buttons that reflect a differnt page or post than what is being viewed.</li><li>2. New Feature: Upgraded the Click-to-Tweet shortcode generator. It now allows you to specify whether you want to use your default style or select a specific one for each instance.</li><li>3. Performance: Made it so that Google and other search engines are always served cached numbers so they always get the fastest version of the page.</li><li>4. Performance: Reduced database queries down to zero when serving cached data.</li><li>5. Performance: Eliminated the Click-to-Tweet CSS file and the image that was used for the icon cutting out 2 of the http requests.</li><li>6. Performance: Made it so the cache is rebuilt silently after the page has already completed loading. This means that all API requests and database calls are now conducted in a way that will never slow down the time it takes to generate and load the page for the user.</li><li>7. Performance: Several other modifications were made including how the html is generated for the buttons, how functions are called, and more that all help to reduce the performance footprint of this plugin as much as possible.</li></ul></p><p>1.3.8: Got the new Tumblr, Reddit, and StumbleUpon buttons back up and working. Lots of progress on this thing today! Woot! Woot!</p><p>1.3.7: Fixed the Google Plus share count glitch. They should now fetch counts properly again.</p><p>1.3.6: Fixed the buttons that were appearing at the top of some pages. Also fixed some conflicts that were occurring with the Yoast SEO plugin.</p><p>1.3.5: Fixed the performance issue that was introduced in yesterday's release. This thing should now be lightning fast again!</p><p>1.3.4: Fixed the buttons counts, hid the registration message (non-registered plugins will not have any features disabled until I can get this function to work properly), and the display locations should work properly again. Thanks for all your patience and terrific feedback!</p><p>1.3.3: Minor Bug Fix</p><p>1.3.2: Added support for Reddit, Tumblr, Email, and StumbleUpon buttons. Fixed some minor bugs. Also, this fixes the missing icons.</p><p>1.3.1: Minor Bug Fixes from Today's Update<ul><li>Fixed a 404 request to a javascript file.</li><li>Fixed the total shares on floating sidebars. They now hide properly when set to not show.</li><li>Fixed the excerpt from appearing in the header.</li></ul></p><p>1.3.0: This update packs a lot of cool new features. After updating, be sure to reset your caching plugins, especially anything that might be serving up cached, or outdated, javascript and CSS.<ul><li><b>Rebuilt the CSS for the visual themes and floating sidebar buttons. There are now thousands of shape, color and hover state combinations that can be created.</b></li><li><b>Added a new 'Boxed' version of the floating sidebar buttons.</b></li><li>Added the option to hide the share count numbers when a network is reporting zero shares on that network.</li><li>Refined the mobile sizing algorithm. The buttons will now show counts on mobile if it measures and determines that there is enough space to do so.</li><li>Modified the way buttons are sized so that if a site hides the content and then fades it into view using javascript, our plugin will now wait until it is visible prior to sizing them.</li><li>Added Frensh button translations.</li><li>Fixed an error that was causing the background of the floating share bar to always be white regardless of what color it was set to be.</li><li>Fixed the registration page infinite loop error.</li></ul><li>Reduced the size of the javascript from 34KB to 11KB for front-end page loads. </li></p><p>1.2.26:<ul><li>Added the ability to sort icons dynamically based on the number of shares for each network.</li><li>Fixed an issue wherein the buttons weren't showing up on home pages or blog archive feeds on some themes.</li><li>Changed it so that Pinterest images and URLs are not URL Encoded but the Pinterest descriptions are (important when special characters are included).</li><li>Fixed the default margin and border on the connected visual style.</li><li>Added a 'Rare Configurations' tab for certain bug fixes that are rarely encountered.</li><li>Modified the hover state of the total shares button so that it doesn't affect the totesalt class version of the button.</li></ul></p><p>1.2.25:<ul><li>Fixed an issue where some themes were changing the margin of our button container element.</li><li>Updated the float conditional statement so that it will now not only work on pages and posts, but also on Custom Post Types as well.</li><li>Updated the function that makes sure that share counts (like Pinterest) don't go back down or disappear entirely.</li><li>Cleaned up the old version of the 'Total Shares' button.</li><li>Updated the Z-index of the floating bar so that it doesn't get hidden on some themes.</li></ul></p><p>1.2.24: Bug fix for a misspelled function name.</p><p>1.2.23: Fixed an issue with Bitly caching old links and not updating when page URLs get modified. Also fixed an issue that was causing the buttons to show up on posts embedded inside other posts like on related posts at the bottom of content.</p><p>1.2.23: Updated the Google Plus icon and fixed a few minor bugs. Be sure to empty your caching plugins!<p><p>1.2.21: Fixed another javascript bug.</p><p>1.2.20: Minor bug fix.</p><p>1.2.19: Fixed to bugs. 1. Fixed a bug that broke the order of icons from working properly. You will need to resave your order preference after this update. 2. Fixed a bug that affected the registration process in some instances.</p><p>1.2.18: Updated the Custom Tweet counter logic to count links the same way that Twitter does.</p><p>1.2.17: Changed the way networks are enqueued for share count fetching. This fixes a minor bug, but also streamlines some of the development hooks and filters that we've been working on.</p><p>1.2.16: Fixed a broken javascript link that was making everything act crazy. Whoops!</p><p>1.2.14: Updated 2 class names to avoid CSS conflicts with other plugins or themes.</p><p>1.2.13: Added an option that should fix a bug that causes the share buttons to appear twice at the bottom of a page when user's have a visual editor installed via a plugin or theme rather than using the built-in WordPress editor.</p><p>1.2.12: Cleaned up the registration process some more. It should be more intuitive than ever now.</p><p>1.2.11: Some more subtle refinements of the Open Graph tags.</p><p>1.2.10: Rebuilt the registrations functions. Fixed a formatting issue with Twitter shares in the floating sidebar. Fixed some Open Graph tags issues.</p><p>1.2.9: Updated the way share recovery works.</p><p>1.2.8: Updated the Open Graph tags. Now if you don't provide the minimum required information, it won't output a partial Open Graph tag set. You'll need to have at least a featured image or the Social Media Image declared now.</p><p>1.2.7: Fixed a minor bug with the horizontal floating bars.</p><p>1.2.6: Updated the way share recovery works. If the recovered shares are identical to the current shares, we now assume that that particular network has already picked up on your 301 redirect and we do not add them together. Only if the share counts are different do we assume that they need recovered.</p><p>1.2.5: Updated the horizontal Floating Share Buttons for mobile.</p><p>1.2.4: Adjusted the way the buttons are sized on hover. It should be a much cleaner animation now.</p><p>1.2.3: This is another update packed with new features. Check this out:<ul><li>Updated the way Twitter cards work. Now if you don't have any images added, it will revert to the standard, non-image Twitter summary card.</li><li>Added a share recover system. If you've ever changed your permalink structure on your blog, you can now recover the shares that had been made on your previous URL structure.</li><li>Added a shortcode function that allows you to place Social Warfare buttons on any page, but reflect all settings (share counts, links, titles, descriptions, and images) of a different page. For example, you might want to place buttons on a 'Thank You For Subscribing' page, but you want to reflect the share counts of the actual 'Subscribe' call-to-action page. And more importantly, that the page you want your users sharing after they subscribe. This one can be powerful. Here's an example shortcode to show how it works: [social_warfare post_id=\"127\"]. The post_id field can be the ID of a post, page or any other custom post type that has a WordPress ID.</li><li>Fixed an issue with how the excerpt was being formatted for the open graph and Twitter card descriptions that was, in some cases, adding a 'Read More' html tag to the header of a page.</li><li>I've also expanded the amount of information that's output to the Open Graph tags. I've also ensured that our plugin coordinates intelligently with WordPress SEO by Yoast (when installed) when generating these open graph tags.</li><li>Fixed a typo in the CSS that was making the wrong font appear on the side floating buttons.</li><li>Added Dutch to the list of available languages courtesy of Daniel Philipsen. That means we now have 5 languages built in. Please contact us if you'd like to contribue a new language for us.</li></ul></p><p>1.2.2: This update is all about Twitter.<ul><li>Added Twitter Cards. Woot! Woot!</li><li>I've also added a 'Twitter Username' field to user's profiles. Now, if you want, you can add individual author usernames and have the 'via @username' point to the author of that post.</li><li>I also modified the behavior of the Open Graph tags. This should now work much, much better.</li></ul></p><p>1.2.1: Minor bug fix from the 1.2.0 upgrade.</p><p>1.2.0: This update has been a big push to create developer hooks that will hopefully get more developers involved and help to expand the available features through the creation of addons or functions.php recipes. In order to do this, we've been toiling behind the scenes rebuilding many files and functions from the ground up. Here's a look what this update brings with it:</p><ul><li>1. Changed the way the user's options selections are fetched drastically reducing database calls.</li><li>2. Changed the way the buttons are sized</li><li>3. Built in a multilingual functionality. There is currently only one language (Enlish), but now others can easily be added to the plugin. Feel free to send us translations that you would like to see added to the plugin.</li><li>4. Changed the way share counts are fetched. Previously each share count was fetched one at a time beginning the request as soon as the previous request was finished. Now all share requests fire off at the same time. This will drastically reduce the amount of time it takes to fetch new share counts when the cache on the existing counts expires.</li><li>5. Added a developer hook to allow additional link shortening integrations to be created.</li><li>6. Added a developer hook to allow additional analytics parameters to be used with Social Warfare.</li><li>7. Changed the priority of the Social Warfare function hook to fix the double share button bug.</li><li>8. Added developer hooks for adding options to the Social Warfare settings page and also to fetch the options that the user has set.</li><li>9. The developer hooks necessary to add additional social network share buttons are about 75% complete.</li><li>10. Adjusted some CSS to clean up the custom options display on the post editor.</li><li>11. Fixed some trailing commas in the javascript file that may have interfered with minifying the javascript.</li><li>12. Fixed an issue with the naming of our widget function to avoid conflicts with other plugins that were using the same naming pattern.</li><li>For more information about this update and our vision for the future, check out our blog post here: <a href='http://warfareplugins.com/social-warfare-1-2-developer-hooks-major-optimizations-and-bug-fixes/'>Social Warfare 1.2: Developer Hooks, Major Optimizations, and Bug Fixes.</a></li></ul><p>1.1.17 Fixed an issue that was creating a conflict with the native Pinterest plugin.</p><p>1.1.16 Changed the html structure of the buttons and click to tweets to coordinate with Postmatic. Both the buttons and Click to Tweets will now go through in the email notifications pending Postmatic's update to their plugin which is coming within the next week.</p><p>1.1.15 Fixed another tiny hiccup with the floating share bar.</p><p>1.1.14 Fixed the floating bar sizing glitch. Woohoo!</p><p>1.1.13 Adjusted the sizing algorithm to make it more responsive than ever.</p><p>1.1.12 Fixed special characters that weren't populating in the share boxes properly.</p><p>1.1.11<ul><li>Adjusted the priority at which the Social Warfare function is called.</li><li>Adjusted a mobile CSS issue.</li></ul></p><p>1.1.10 Fixed the visual display of the side floating buttons when the share counts are hidden.</p><p>1.1.9<ul><li>Fixed the Admin Page view in Firefox</li><li>Fixed an Admin page SSL error</li><li>Fixed a WP_DEBUG undefined variable error.</li><li>Fixed a few typos in the readme file.</li></ul></p><p>1.1.8 Fixed a javascript issue for the size script.</p><p>1.1.7 Modified the way placement works for Custom Post Types</p><p>1.1.6 Fixed an issue that was causing apostrophes and certain other special characters to become malformed on Twitter and Pinterest sharing.</p><p>1.1.5 Fixed a Facebook Open Graph issue</p><p>1.1.4 Fixed a bug that was affecting the way the plugin behaved on certain custom post types.</p><p>1.1.3 Added Full Support for Custom Post Types</p><p>1.1.2 Fixed an issue that was causing the Google Analytics UTM codes to behave strangely on Facebook sharing.</p><p>1.1.1 A few minor bug fixes.</p><p>1.1.0 Completely rebuilt the post editor options with character counters and more guidance. We also now automatically add a user's Twitter handle to the Click-to-Tweet sections.</p><p>1.0.24 Added the option to enable/disable Google Analytics UTM tracking. Also added the options to be able to customize the source and campaign names for the tracking data.</p><p>1.0.23 Some themes are adding a text-shadow to the icons that make them look blurry. This update forces there to be no text-shadow so that they remain crisp and clean looking.</p><p>1.0.22 Removed UTM Tracking Data from Pinterest because it appears to impact the count totals.</p><p>1.0.21 Fixed an undefined javascript bug that appears every once in a while.</p><p>1.0.20 Fixed a spacing issue on the admin options page.</p><p>1.0.19 Updated some of the styles so that the borders are more consistent. Fixed a glitch that was causing the setting page to display at the wrong width in the presence of some themes and plugins.</p><p>1.0.18 Fixed a special character bug on some Twitter shares.</p><p>1.0.17 Fixed an erroneously named function call.</p><p>1.0.16: 1. Fixed a small javascript error. 2. Changed a another function name to avoid conflicts with themes that have similar functions.</p><p>1.0.15: Added a new Social Warfare icon for the menu item.</p><p>1.0.14 Finished fixing the 'Connect() Timed Out!' error, and changed the name of the bitly function to avoid conflicts with other apps that may have a similar function.</p><p>1.0.13 Fixed a 'Connect() Timed Out!' error that was occurring on some sites. In the event that it fails to retreive share numbers for any particular network, it will now simply fall back and use the share numbers from the last successful connection with that network.</p><p>1.0.12 Fixed a CSS style bug that was causing the Total Shares button to not use the correct colors. Fixed a bug that was pushing the last button to a new line when the total shares is displayed on the left.</p><p>1.0.11 Fixed Pinterest UTM tracking Code, changed outlines to use transparent background instead of white background.</p><p>1.0.10 Fixed two minor bugs.</p><p>1.0.9 Added some checks that should help to avoid duplicate meta issues and help to optimize the database.</p><p>1.0.8 Fixed some link formatting issues related to the new Bitly integration.</p><p>1.0.7 Playing Wack-A-Mole: Smacked down another Bitly bug.</p><p>1.0.6 Custom color overlays were broken. They're not anymore.</p><p>1.0.5 Fixed a setting that was breaking pinned links.</p><p>1.0.4 Tiny Bitly bug fix.</p><p>1.0.3 Added Bit.ly Support...and fixed a few bugs!<ul><li>You can now shorten links using the Social Warfare (wfa.re) link shortening service.</li><li>You can also shorten links using your own bit.ly account using any of Bitly's URL shortening formats including your own vanity URL. You can control your own accounts formatting inside of your Bitly account.</li><li>Fixed a bug that was formatting special characters and foreign characters in bizarre ways.</li><li>Added custom class prefixes to avoid any styling conflicts from a theme that may be using the same css class that we had been using.</li></ul></p><p>1.0.2 The 1.0.0 was erroneously linking to the Click to Tweet stylesheet. This is now fixed.</p><p>1.0.1 Minor Bug Fix that occurred during the 1.0.0 upgrade.</p><p>1.0.0 Lots of new features and bug fixes on this one. Here's what this update has in store:<ul><li>Feature: 75+ Style/Color Combinations to Choose From</li><li>Feature: Live preview of buttons on admin options page.</li><li>Feature: Switched from Image Backgrounds to Font Awesome</li><li>Feature: Added UTM Tracking Data</li><li>Maintenance: Cleaned and Organized the CSS files</li><li>Maintenance: Rebuilt the Core Function</li><li>Bug Fixed: Fixed the Activation/Registration Glitch</li><li>Bug Fix: Fixed the Sniply/Frame Buster from breaking the Admin Customizer Page</li></ul></p><p>0.6.10 Fixed a scripting error that stopped the javascript from being called on some server configurations.</p><p>0.6.9 Fixed an a CSS style conflict that appeared on certain themes.</p><p>0.6.8 The incompatability issues with BuddyPress have now been resolved.</p><p>0.6.7 Fixed a minor glitch in the popular posts widgets. Turning off the share count now ACTUALLY turns off the share count.</p><p>0.6.6 Fixed a bug that impacted the way share buttons are displayed on mobile when individual or total shares were turned off.</p><p>0.6.5 Fixed the responsive version of the plugin when the Outlines format is selected.</p><p>0.6.4 Added the option to hide the individual network share counts.</p><p>0.6.3 Corrected the Open Graph issue by removing it from having any effects on non-posts/pages.</p><p>0.6.2 Adjusted the floating share bar for mobile. It now measures the amount of space on the left. If space is limited, it shrinks to icons only. If there is not enough space for icons, it hides completely.</p><p>0.6.0<ul><li>Added the brand new left side floating share bar. More style options will be coming later.</li><li>Modified the Click to Tweet box so that the entire box is linkified.</li><li>Added a brand new Click to Tweet visual style.</li><li>Integrated Sniply Buster directly into the Social Warfare plugin.</li><li>Fixed the 'Dancing Share Buttons' glitch.</li></ul></p><p>0.5.14 Fixed an open graph conflict with WordPress SEO by Yoast.</p><p>0.5.13 Added a fix for raw shares showing up on certain configurations. If you see raw share numbers when you share a post, navigate to the 'Visual Options' tab of the Social Warfare options page. Scroll all the way to the bottom and check the button and click save.</p><p>0.5.12 Fixed a very minor 'total shares' glitch on the widget.</p><p>0.5.11 Bunch of little fixes and behind the scenes enhancements.<p><p>0.5.10 Fixed an alignment issue for the buttons on mobile when the total shares is disabled.</p><p>0.5.9 Fixed the alignment of the far right button when the total share count is disabled. <br />Fixed the invalid header error that was occurring on plugin activation.</p><p>0.5.8 Fixed a javascript conflict that was causing some featured images not to work properly on mobile devices.</p><p>0.5.7 Fixed a small glitch that was showing unformatted share numbers on certain excerpts.</p><p>0.5.6 Added a new visual style (Outlines) with three hover effects.</p><p>0.5.3 - 0.5.5 Fixed a slight spacing issue.</p><p>0.5.2 Rebuilt the Meta Box Class to avoid conflicts with other plugins or themes that use the same class.</p><p>0.5.1 Very minor bug fix for a very particular mobile screen size.</p><p>0.5.0 Added a whole bunch of new style options, hover effects, color settings, and total shares display formats.</p><p>0.4.37 Minor bug fix.</p><p>0.4.36 Fixed a bug that was causing some buttons to be sized poorly on homepages or blog post loop pages.</p><p>0.4.35 Updated the Click to Tweet styles...slightly.</p><p>0.4.34 Fixed a non-display issue that happened on certain server configurations.</p><p>0.4.33 Fixed the resizing function and hover animations that were created glitches on certain websites.</p><p>0.4.32 Fixed the glitch that was showing raw share numbers without any html styling in some excerpts and shares.</p><p>0.4.31 Fixed the SSL error that had been appearing.</p><p>0.4.30 Updated an SSL setting.</p><p>0.4.29 Updated the class that generated the custom fields on the post edit pages in an effort to fix some errors that were being generated on some server configurations.</p><p>0.4.28 Fixed the font weight of the click to tweet text. It was so thin it was illegible in some instances.</p><p>0.4.27 Fixed a style conflict with the fade class that was creating a conflict on some themes.</p><p>0.4.26 SSL Bug Fix</p><p>0.4.25 Optimized some styling and added an easy link to the Affiliate Section of Warfare Plugins.</p><p>0.4.24 Fine-tuned the plugin to allow it to work seamlessly on SSL enabled websites. Also modified some visual styling to fix a very minor bug.</p><p>0.4.23 Completely rebuilt the registration process. It should now be easier than ever to register your copies of Social Warfare and to track your used and unused licenses through the 'My Account' page on the Warfare Plugins Website.</p><p>0.4.22 It now works seemlessly with WordPress SEO by Yoast concerning Open Graph Tags. Your website will make use of Yoast's Open Graph Tags except for on those posts that you manually craft a title, a description, or an image. Only on those specific posts with the Open Graph tags by Yoast be removed and replaced with ours.</p><p>0.4.21 Fixed an important typo in the Open Graph section of the plugin.</p><p>0.4.20 Added some more open graph support!</p><p>0.4.19 Added a far greater level of Open Graph support which allows you to customize the images, titles, and descriptions of content shared on Facebook, LinkedIn, and Google Plus at a much more granular level. Enjoy!</p><p>0.4.18 Forcing all API requests to resolve using IPV4 for sites that are not yet configured to handle IPV6 requests yet.</p><p>0.4.16 Minor Bug Fix related to the dynamic sizing of the share buttons.</p><p>0.4.15 Attempting to fix a connection error.</p><p>0.4.14 Fixed a positions bug for the floating bar on responsive that occurred on some site configurations.</p><p>0.4.13 Modified the location-on-page logic.</p><p>0.4.11 Disabled all share functionality for non-published posts (drafts, scheduled posts, etc.). This will prevent networks from caching the page as a 404 since the post does not yet publicly exist.</p><p>0.4.10 Fixed a script call error that was occurring on some servers.</p><p>0.4.9 Corrected a few issues with certain PHP notices that were being triggered.</p><p>0.4.8 Centered the icons on mobile/responsive display.</p><p>0.4.7 More responsive tweaks. It now auto adjusts if the screen size is changed after the page has already been loaded.</p><p>0.4.6 Massive overhaul for the mobile layout. This plugin is now more responsive than ever before.</p><p>0.4.5 Compressed several of the assets and moved them onto a CDN for faster load speeds.</p><p>0.4.4 Removed debugging information from 0.4.3</p><p>0.4.3 Updated the caching logic.</p><p>0.4.2 Modified the number formatting on the share count to match the same as the button settings.</p><p>0.4.1 Converted the popular posts format into list items for better formatting.</p><p>0.4.0 Created the Popular Posts Widget</p><p>0.3.19 Refined and reduced the size of the icon file.</p><p>0.3.18 Added a reminder to not use quotation marks in the Click to Tweet shortcode generator fields.</p><p>0.3.17 Fixed a bug that was stopping the 'Click to Tweet' functionality from working properly.</p><p>0.3.16 Fixed a bug that was creating a design conflict when native pinterest widgets were present on the same page.</p><p>0.3.15 Fixed a number formatting error on certain cached results.</p><p>0.3.14 Fixed an error with the caching mechanism causing it to not display any numbers.</p><p>0.3.13 Updated the caching structure</p><p>0.3.12 Temporarily removing the admin notice.</p><p>0.3.11 Fixed the bug that made it impossible to disable any of the icons. The functionality to enable or disable each network's icon is not active again.</p><p>0.3.10 Hopefully fixed the 'two lines of share icons' bug.</p><p>0.3.9 Fixed a bug with the floating share bar.</p><p>0.3.8 Added the option to select no styling for the Click to Tweet option. This will be useful for those who wish to create custom CSS inside their own site's theme.</p><p>0.3.7 Bug Fix</p><p>0.3.6 You can now select the number of decimals places you would like to display on numbers over 1,000.</p><p>0.3.5 The location of the share buttons can now be specifically defined for individual posts.</p><p>0.3.4 Added documentation to the 'Advanced Usage' tab for sorting posts by most popular according to shares. This can be used for widgets or special pages that feature your most widely shared content.</p><p>0.3.3 Added two additional styles for your click to tweet boxes.</p><p>0.3.2 Added a link to the settings page from the plugins page.</p><p>0.3.1 Added documentation for the Click to Tweet option. You can find it on the Help / FAQ tab of the Social Warfare settings page.</p><p>0.3.0 CLICK TO TWEET! That's right ladies and gentlemen. You can now easily add 'Click to Tweet' quotables within your articles. </p><p>0.2.60 Fixed a caching issue on some server configurations.</p><p>0.2.59 Removed Admin Notice (which will be coming back eventually to combat piracy and made another adjustment to 0.2.57's update.</p><p>0.2.58 Added a 'Help / FAQ' page and an 'Advanced Usage' page with guidance for theme developers.</p><p>0.2.57 Fix default options to fix upgrade issues</p><p>0.2.56 This version adds a 'System Status' tab which will allow you to include information about your WordPress environment when reporting issues. This will allow us to more easily identify conflicts that may be creating issues.</p><p>0.2.55 Add option to manually place the buttons in your theme. Set placement options to 'none/manual placement' and place the function socialWarfare() in your theme where you want it to appear.</p><p>0.2.54 This version caches the results so networks are only pinged once per hour. This will drastically increase the speed of subsequent page loads.</p><p>0.2.53 Changed the menu icon so it looks cooler.</p><p>0.2.52 This version updates the server wherein the updates live.</p><p>0.2.51 Corrected a CSS style conflict that occurred with some WordPress themes.</p><p>0.2.50 Changed the capabilities necessary to access the options page from edit_themes to update_plugins.</p><p>0.2.49 Reverted back to server side stat requests and fixed an issue related to HTML tags appearing in some title tags.</p><p>0.2.48 Created a workaround for a facebook glitch that returned undefined instead of zero for pages with no current share stats.</p><p>0.2.47 Another typo. There are too many lines of code. My eyes are bleeding.</p><p>0.2.46 Fixed a typo that made a huge glitch.</p><p>0.2.45 Switched all calls for statistics to client side calls with the exception of Google Plus.</p><p>0.2.44 Disabled remote calls for share statistics for network buttons that have been turned off.</p><p>0.2.38 More open graph updates.</p><p>0.2.37 Open graph updates.</p><p>0.2.36 Plugin now uses the assigned thumbnail image for sharing to Google Plus.</p><p>0.2.35 Fixed the bug that allows curly quotes to mess up the link when certain types of apostraphes are present.</p><p>0.2.34 Added additional padding to the bottom of the page so when the floating bar is at the bottom, it won't cover copyright information at the bottom.</p><p>0.2.33 The floating bar now works at both the top and bottom.</p><p>0.2.32 Fixed the floating option so that it only appears on the single post and pages.</p><p>0.2.31 Update the way that the floating share bar hides and reveals to make it much more fluid and clean.</p><p>0.2.30 Added the option to select the background color of the floating share bar.</p><p>0.2.29 Modified the floating formula to accomodate a wider variety of situations it may encounter.</p><p>0.2.28 Tweaked the appearance/disappearance setting of the float bottom feature to make the transitions cleaner.</p><p>0.2.27 Made the 'float on the bottom' option operational.</p><p>0.2.26 Removed the changelog from the admin options page.</p><p>0.2.25 Fixed a glitch that would cause certain special characters to act funny on the pinterest share.</p><p>0.2.24 Added a default set up options so that it doesn't act retarded before saving the options for the first time.</p><p>0.2.23 Versioned the scripts and styles so caching issues won't be an issue during updates.</p><p>0.2.22 Changed the javascript to create a better resizing experience on different platforms.</p><p>0.2.21 Changed some class names to avoid stylesheet conflicts on some themes.</p><p>0.2.20 This twitter issue was because the hashtags were not URL encoded and it was confusing the browser in the address bar. This should hopefully resolve that issue.</p><p>0.2.19 Pushing this update to test some stuff on a beta testers site. Nothing to see here.</p><p>0.2.18 Attempted once again to correct the issue of Twitter always forcing an additional link onto custom tweets that already have a link in them.</p><p>0.2.17 Fixed a naming error that caused 0.2.16 not to upgrade properly.<p>0.2.16 We completely rebuilt the admin panel, rebuilt the options classes to load much more quickly, and added the ability to drag & drop the order in which the icons appear on your site.</p><p>0.2.15 The tweet button was ALWAYS posting a link to the current page. This was problematic for those who included a link in the custom tweet message as it created to links to the page. This is now resolved.</p><p>0.2.14 Pinterest is now fully working. In order of priority, it checks three places for an image: 1. It checks the Pinterest image field located in the Social Warfare settings on the post editor. 2. If that isn't found, it checks to a thumbnail assigned to the post. 3. If neither of those are found, it scans the page and allows the user to select an image.</p><p>0.2.13 Created a fallback for the color sets so that the errors on upgrading no longer occur.</p><p>0.2.12 The pinterest image now works if there is at least a post thumbnail assigned to an article.</p><p>0.2.11 Add two additional color sets: <br /><b>Full Color:</b> Icons appear and remain in full color from start to finish. <br /><b>Fade:</b> Icons appear in full color. When an icon is hovered, the other icons fade slighly.  <br /><b>Grayscale:</b> Icons appear gray until the social panel is hovered over.</p><p>0.2.10 When hovering over the total shares icon, the other other icons were failing to adjust back to their normal sizes properly. This is now fixed.</p><p>0.2.9 The math in the jQuery has been refined even further so that the buttons now resize much more smoothly on their hover states and the right side of the set remains almost perfectly still.</p><p>0.2.8 Although the right side of the icons is still moving ever so slightly, the icons now adjust their widths on hover much more smoothly.</p><p>0.2.7 Fixed the line-height of the total shares container.</p><p>0.2.6 Fixed a line height issue to further the consistency across multiple themes.</p><p>0.2.5 Updated the CSS to ensure a more consistent look across the various themes that it finds itself on.</p><p>0.2.4 The | character was creating problems with the urls causing the tweet box to not populate properly.</p><p>0.2.3 The JSON file associated with the auto update feature was formatted improperly creating an issue when attempting to update the plugin.</p><p>0.2.2 The bug causing the 'This Plugin does not contain valid headers' message on initial install has been resolved.</p><p>0.2.1 The automatic update feature was creating problems on some server configurations. We're happy to announce that the automatic update feature now works.</p><p>0.2.0 This version includes the ability to automatically update the plugin from within the WordPress admin.</p>"
    }
}
